[
{"title":"Javascript: The Good Parts","isbn":"9780596517748","published":"2008-05-01","description":"Offers an explanation of the features that make JavaScript an object-oriented programming language, and warns you about the bad parts. This book defines a subset of JavaScript that's readable and maintainable than the language. It offers ideas that include functions, loose typing, dynamic objects, and an expressive object literal notation.","language":"English","genre":"1"},
{"title":"Clean Code","isbn":"9780132350884","published":"2008-08-01","description":"Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship. Martin has teamed up with his colleagues from Object Mentor to distil their best agile practice of cleaning code 'on the fly' into a book that will instil within you the values of a software craftsman and make you a better programmer-but only if you work at it. What kind of work will you be doing? You'll be reading code-lots of code. And you will be challenged to think about what's right about that code, and what's wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code-of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and 'smells' gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding. How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development. This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.","language":"English","genre":"1"},
{"title":"Software Engineering, Global Edition","isbn":"9781292096131","published":"2015-07-01","description":"For courses in computer science and software engineering The Fundamental Practice of Software Engineering Software Engineering introduces students to the overwhelmingly important subject of software programming and development. In the past few years, computer systems have come to dominate not just our technological growth, but the foundations of our world's major industries. This text seeks to lay out the fundamental concepts of this huge and continually growing subject area in a clear and comprehensive manner. The Tenth Edition contains new information that highlights various technological updates of recent years, providing students with highly relevant and current information. Sommerville's experience in system dependability and systems engineering guides the text through a traditional plan-based approach that incorporates some novel agile methods. The text strives to teach the innovators of tomorrow how to create software that will make our world a better, safer, and more advanced place to live.","language":"English","genre":"1"},
{"title":"Fundamentals of Database Systems, Global Edition","isbn":"9781292097619","published":"2016-08-01","description":"For database systems courses in Computer Science. This book introduces the fundamental concepts necessary for designing, using, and implementing database systems and database applications. Our presentation stresses the fundamentals of database modelling and design, the languages and models provided by the database management systems, and database system implementation techniques. The book is meant to be used as a textbook for a one- or two-semester course in database systems at the junior, senior, or graduate level, and as a reference book. The goal is to provide an in-depth and up-to-date presentation of the most important aspects of database systems and applications, and related technologies. It is assumed that readers are familiar with elementary programming and data-structuring concepts and that they have had some exposure to the basics of computer organization.","language":"English","genre":"1"},
{"title":"Clean Architecture","isbn":"9780134494166","published":"2017-09-01","description":"Building upon the success of best-sellers The Clean Coder and Clean Code, legendary software craftsman Robert C. 'Uncle Bob' Martin shows how to bring greater professionalism and discipline to application architecture and design. As with his other books, Martin's Clean Architecture doesn't merely present multiple choices and options, and say 'use your best judgment': it tells you what choices to make, and why those choices are critical to your success. Martin offers direct, no-nonsense answers to key architecture and design questions like: What are the best high level structures for different kinds of applications, including web, database, thick-client, console, and embedded apps? What are the core principles of software architecture? What is the role of the architect, and what is he/she really trying to achieve? What are the core principles of software design? How do designs and architectures go wrong, and what can you do about it? What are the disciplines and practices of professional architects and designers? Clean Architecture is essential reading for every software architect, systems analyst, system designer, and software manager -- and for any programmer who aspires to these roles or is impacted by their work.","language":"English","genre":"1"},
{"title":"JavaScript: How JavaScript Works","isbn":"9781949815009","published":"2018-10-01","description":"This book is for people who have had some experience with Java¬Script, and want to have a better, deeper understanding of how it works and how to use it well. It is also for experienced programmers who are looking to understand the workings of another language. This book is not for beginners. I hope to someday write a book for beginners. This is not that book. This is not a light book. If you skim it, you will likely get nothing from of it. This book is not about JavaScript engines or virtual machines. It is about the language itself and the things every programmer should know about it. This book is a radical reappraisal of JavaScript, how it works, how it could be made better, and how it can be better used. It is about how to think about Java¬Script and how to think in Java¬Script. I am going to pretend that the current version of the lan¬guage is the only version. I am not going to waste your time by showing how things worked in ES1 or ES3 or ES5. That does not matter. The focus is on how Java-Script works for us now. This book is not comprehensive. There are large, complex chunks of the language that will be dismissed without a word. If I fail to mention your most favourite feature, that is most likely because that feature is crap. I will not be paying much attention to syntax. I am assuming that you already know how to write an if statement.","language":"English","genre":"1"},
{"title":"Applying UML and Patterns","isbn":"9780131489066","published":"2004-10-01","description":"Presents a step-by-step process to master object-oriented analysis and design, from requirements gathering all the way to code generation, using the latest version of the industry standard modelling language. Original. (Advanced)","language":"English","genre":"1"},
{"title":"Scaling Lean & Agile Development: Thinking and Organizational Tools for Large-Scale Scrum","isbn":"9780321480965","published":"2008-12-01","description":"Lean Development and Agile Methods for Large-Scale Products: Key Thinking and Organizational Tools for Sustainable Competitive Success Increasingly, large product-development organizations are turning to lean thinking, agile principles and practices, and large-scale Scrum to sustainably and quickly deliver value and innovation. However, many groups have floundered in their practice-oriented adoptions. Why? Because without a deeper understanding of the thinking tools and profound organizational redesign needed, it is as though casting seeds on to an infertile field. Now, drawing on their long experience leading and guiding large-scale lean and agile adoptions for large, multisite, and offshore product development, and drawing on the best research for great team-based agile organizations, internationally recognized consultant and best-selling author Craig Larman and former leader of the agile transformation at Nokia Networks Bas Vodde share the key thinking and organizational tools needed to plant the seeds of product development success in a fertile lean and agile enterprise. Coverage includes Lean thinking and development combined with agile practices and methods. Systems thinking. Queuing theory and large-scale development processes. Moving from single-function and component teams to stable cross-functional cross-component Scrum feature teams with end-to-end responsibility for features Organizational redesign to a lean and agile enterprise that delivers value fast. Large-scale Scrum for multi-hundred-person product groups. In a competitive environment that demands ever-faster cycle times and greater innovation, applied lean thinking and agile principles are becoming an urgent priority. Scaling Lean & Agile Development will help leaders create the foundation for their lean enterprise-and deliver on the significant benefits of agility. In addition to the foundation tools in this text, see the companion book Practices for Scaling Lean & Agile Development: Large, Multisite, and Offshore Product Development with Large-Scale Scrum for complementary action tools.","language":"English","genre":"1"},
{"title":"Clean Agile","isbn":"9780135781869","published":"2019-10-01","description":"Twenty years after the Agile Manifesto was first presented, the legendary Robert C. Martin (Uncle Bob) reintroduces agile values and principles for a new generation of software developers. In this eagerly awaited book, the best-selling author of The Clean Coder shows how to bring unprecedented levels of professionalism and discipline to agile development-and thereby write far more effective, successful software. As with his other books, Martin's Clean Agile: Back to Basics doesn't merely present multiple choices and options, and say 'use your best judgment'; it tells you what choices to make and why those choices are critical to your success. Writing in the agile context, Martin offers direct, no-nonsense answers to crucial questions: How and why did agile begin? What are the costs and benefits of agile? What are the most effective practices of agile development? How should an agile team be organized? What roles do programmers, testers, and managers play in an agile team? What is the role of the Agile Coach? What about agile for large projects? What kinds of projects benefit from agile? Clean Agile: Back to Basics is essential reading for programmers, managers, testers, project managers, and every software professional called upon to lead or participate in an agile project.","language":"English","genre":"1"},
{"title":"Large-Scale Scrum","isbn":"9780321985712","published":"2016-08-01","description":"The Go-To Resource for Large-Scale Organizations to Be Agile Rather than asking, 'How can we do agile at scale in our big complex organization?' a different and deeper question is, 'How can we have the same simple structure that Scrum offers for the organization, and be agile at scale rather than do agile?' This profound insight is at the heart of LeSS (Large-Scale Scrum). In Large-Scale Scrum: More with LeSS, Craig Larman and Bas Vodde have distilled over a decade of experience in large-scale LeSS adoptions towards a simpler organization that delivers more flexibility with less complexity, more value with less waste, and more purpose with less prescription. Targeted to anyone involved in large-scale development, Large-Scale Scrum: More with LeSS, offers straight-to-the-point guides for how to be agile at scale, with LeSS. It will clearly guide you to adopt LeSS structure a large development organization for customer value. Clarify the role of management and Scrum Master. Define what your product is, and why. Be a great Product Owner. Work with multiple whole-product focused feature teams in one Sprint that produces a shippable product. Coordinate and integrate between teams . Work with multi-site teams","language":"English","genre":"1"},
{"title":"International Criminal Law Documents","isbn":"9781108729086","published":"2019-08-01","description":"Written by a team of international lawyers with extensive academic and practical experience of international criminal law, the fourth edition of this leading textbook offers readers comprehensive coverage and a high level of academic rigour while maintaining its signature accessible and engaging style. Introducing the readers to the fundamental concepts of international criminal law, as well as the domestic and international institutions that enforce that law, this book engages with critical questions, political and moral challenges, and alternatives to international justice. Suitable for undergraduate and postgraduate students, academics and practitioners in the field, and cited by the International Criminal Tribunal for Yugoslavia, the International Criminal Court, the Special Court for Sierra Leone, the Extraordinary Chambers in the Courts of Cambodia, and the highest courts in domestic systems, this book is a must-read for anyone interested in learning more about international criminal law.","language":"English","genre":"2"},
{"title":"An Introduction to International Criminal Law and Procedure","isbn":"9781108741613","published":"2019-08-01","description":"For courses in International Economics, International Finance, and International Trade. A balanced approach to theory and policy applications International Economics: Theory and Policy provides engaging, balanced coverage of the key concepts and practical applications of the two main topic areas of the discipline. For both international trade and international finance, an intuitive introduction to theory is followed by detailed coverage of policy applications. With this new Eleventh Edition, Global Edition, the author team of Nobel Prize-winning economist Paul Krugman, renowned researcher Maurice Obstfeld, and Marc Melitz of Harvard University, continues to set the standard for International Economics courses. Pearson MyLab TM Economics not included. Students, if Pearson MyLab Economics is a recommended/mandatory component of the course, please ask your instructor for the correct ISBN and course ID.  MyLab Economics should only be purchased when required by an instructor. Instructors contact your Pearson rep for more information. Pearson MyLab Economics is an online homework, tutorial, and assessment product designed to personalize learning and improve results. With a wide range of interactive, engaging, and assignable activities, students are encouraged to actively learn and retain tough course concepts.","language":"English","genre":"2"},
{"title":"Understanding Jurisprudence","isbn":"9780198806011","published":"2017-10-01","description":"Written with students in mind, Professor Raymond Wacks brings legal theory to life through his lucid and entertaining style. The author has crafted a manageable guide, balancing concise introductions to the key theorists and core issues such as punishment and rights without ignoring the subtleties of the subject. Seminal quotes from leading scholars are included to help students recognise the impact of their work, while extensive further reading suggestions at the end of each chapter invite students to explore the broad range of literature available on central topics. Each chapter concludes with a series of critical questions designed to encourage reader to think analytically about the law and the key debates which surround it. This book is accompanied by online resources which includes multiple-choice questions with instant feedback to give students the chance to test their understanding.","language":"English","genre":"2"},
{"title":"Law: A Very Short Introduction","isbn":"9780198745624","published":"2015-09-01","description":"Law is at the heart of every society, protecting rights, imposing duties, and establishing a framework for the conduct of almost all social, political, and economic activity. Despite this, the law often seems a highly technical, perplexing mystery, with its antiquated and often impenetrable jargon, obsolete procedures, and endless stream of complex statutes and legislation.In this Very Short Introduction Raymond Wacks introduces the major branches of the law, describing what lawyers do, and how courts operate, and considers the philosophy of law and its pursuit of justice, freedom, and equality. In this second edition, Wacks locates the discipline in our contemporary world, considering the pressures of globalization and digitalisation and the nature of the law in our culture of threatened security and surveillance. ABOUT THE SERIES: The Very Short Introductions series from Oxford University Press contains hundreds of titles in almost every subject area. These pocket-sized books are the perfect way to get ahead in a new subject quickly. Our expert authors combine facts, analysis, perspective, new ideas, and enthusiasm to make interesting and challenging topics highly readable.","language":"English","genre":"2"},
{"title":"The Jurisprudence of Lord Hoffmann","isbn":"9781509917693","published":"2017-10-01","description":"Lord Leonard Hoffmann remains one of the most important and influential English jurists. Born in South Africa, he came to England as a Rhodes Scholar to study law at the University of Oxford. After graduating from the Bachelor of Civil Law as Vinerian Scholar, he was elected Stowell Civil Law Fellow of University College. There followed an extremely distinguished judicial career, including 14 years as a member of the Judicial Committee of the House of Lords (from 1995 to 2009).In 2009, Lord Hoffmann returned to the Oxford Law Faculty as a Visiting Professor. In this volume, current and past colleagues of Lord Hoffmann from the University of Oxford examine different aspects of his jurisprudence in diverse areas of private and public law. The contributions are testament to the clarity and creativity of his judicial and extra-judicial writings, to his enduring influence and extraordinary intellectual breadth, and to the respect and affection in which he is held.","language":"English","genre":"2"},
{"title":"European Intellectual Property Law","isbn":"9780198831280","published":"2019-08-01","description":"European Intellectual Property Law offers a full account of the main areas of substantive European IP law and a discussion of their wider context and effect. The amount and reach of European law, and decision-making in the field of intellectual property has grown exponentially since the 1960s, making it increasingly difficult to treat European law as an adjunct to domestic intellectual property regimes. European Intellectual Property Law responds to this reality by presenting a clear and detailed account of each of the main areas of substantive EU intellectual property law, situated in the context of both the EU legal system and international IP law, including EU constitutional law, the law of the European Patent Convention 1973/2000, and private international law. It draws selectively on examples from domestic IP regimes to illustrate substantive differences between those regimes and to demonstrate the impact of European law, and decision-making on EU Member States. This unique, thoroughly modern approach goes beyond a discussion of the provisions of European legal instruments to consider their wider context and effect. European Intellectual Property Law is the ideal guide for any student wishing to gain a full and critical understanding of the substantive European law of intellectual property.","language":"English","genre":"2"},
{"title":"Modern Land Law","isbn":"9781138958098","published":"2016-07-01","description":"Modern Land Law is one of the most current and reliable textbooks available on land law today, offering a lively and thought-provoking account of a subject that remains at the heart of our legal system. Dispelling any apprehension about the subject's formidability from the outset, this compact textbook provides an absorbing and exact analysis of all the key legal principles relating to land. Written with students firmly in mind, a clear introduction to every chapter frames each topic in its wider context and corresponding chapter summaries help to consolidate learning and encourage reflection. This 10th edition has been thoroughly revised and updated to take into account key developments in the law including an updated chapter on registered title in the light of the recent Court of Appeal decision in Swift First v Chief Land Registrar and Goldharp v McLeod. There is an update on the Law Commission's recommendations on easements and covenants, including the `Right to Light' as well as analysis of recent, often contradictory, decisions in case law relating to cohabitation.","language":"English","genre":"2"},
{"title":"Cases & Materials on International Law","isbn":"9780198727644","published":"2016-10-01","description":"Cases & Materials on International Law is a topical and engaging companion for study, offering broad coverage on public international law and placing disputes directly within the context of contemporary debate. The book contains the essential cases and materials that students need in order to fully understand and analyse the international legal system, drawing on a truly global range of jurisdictions and sources. Expert author commentary and notes place selected extracts within the wider legal framework and explain the complexities of the principles of law to students. The sixth edition includes expanded discussion of developing areas, including UN resolutions on climate change and international environmental law, new material from the International Law Commission, and coverage of major events, such as the annexation of Crimea, the legal context for Scottish independence and the UK's exit from the European Union, and the United Nations Security Council's Resolution on Malaysia Airlines MH17.","language":"English","genre":"2"},
{"title":"European Union Law","isbn":"9781107664340","published":"2014-06-01","description":"As the preferred choice of both teachers and students, this textbook offers an unrivalled combination of expertise, accessibility and comprehensive coverage. The new edition reflects the way the economic crisis has impacted the shape and nature of European Union law. Materials from case law, legislation and academic literature are integrated throughout to expose the student to the broadest range of views. Additional online material on the application of EU law in non member states and on rulings on the Fiscal Compact ensures the material is completely current. The new edition includes a timeline which charts the evolution of the EU project. Written in a way which encourages sophisticated analysis, the book ensures the student's full engagement with sometimes complex material. More importantly, it offers the clarity which is essential to understanding. A required text for all interested in European Union law.","language":"English","genre":"2"},
{"title":"International Humanitarian Law","isbn":"9781107537095","published":"2015-09-01","description":"This clear and concise textbook provides an accessible and up-to-date examination of international humanitarian law. With the aid of detailed examples, extracts from relevant cases, and useful discussion questions, students are expertly guided through the text. A recommended reading list is included in every chapter to support deeper engagement with the material. Emerging trends in theory and practice are also explored, allowing readers to build on their knowledge and grapple with some of the biggest challenges facing the law of armed conflict in the twenty-first century.","language":"English","genre":"2"}
]